testFiles/blockMeshTesting/system/changeDictionaryDict0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

p							// field to change
{
	boundaryField
	{
		innerWall          // entry to change
		{
			type            zeroGradient;
		}
	}
}
U
{
	boundaryField
	{
		innerWall          // entry to change
		{
			type            noSlip;
		}
	}
}



// ************************************************************************* //